**** lsp-mode

We use the excellent [[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]] to enable IDE-like functionality for many different programming languages via "language servers" that speak the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].  Before trying to set up =lsp-mode= for a particular language, check out the [[https://emacs-lsp.github.io/lsp-mode/page/languages/][documentation for your language]] so that you can learn which language servers are available and how to install them.

The =lsp-keymap-prefix= setting enables you to define a prefix for where =lsp-mode='s default keybindings will be added.  I *highly recommend* using the prefix to find out what you can do with =lsp-mode= in a buffer.

The =which-key= integration adds helpful descriptions of the various keys so you should be able to learn a lot just by pressing =C-c l= in a =lsp-mode= buffer and trying different things that you find there.

#+begin_src emacs-lisp
  ;; To set the garbage collection threshold to high (100 MB) since LSP client-server communication generates a lot of output/garbage
  (setq gc-cons-threshold 800000)
  ;; To increase the amount of data Emacs reads from a process
  (setq read-process-output-max (* 1024 1024))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (setq lsp-headerline-breadcrumb-enable 1)
    (lsp-enable-which-key-integration t)
    ;; :hook ((css-mode . lsp-deferred)
    ;;    (typescript-mode . lsp-deferred)
    ;;    (javascript-mode . lsp-deferred)
    ;;    (js-mode . lsp-deferred)
    ;;    (c++-mode . lsp-deferred)))
    :hook ((c-mode . lsp-deferred)
	 (c++-mode . lsp-deferred)
	 (typescript-mode . lsp-deferred)
	 (javascript-mode . lsp-deferred)
	 (js-mode . lsp-deferred)
	 (css-mode . lsp-deferred)))
#+end_src

#+RESULTS:
| (lambda nil (js:flycheck:lsp:next-checkers '(css-stylelint)) (setq flycheck-stylelintrc (locate-user-emacs-file ../.stylelintrc.json))) | lsp-deferred |

